Торговля_11__демо/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходныйОрдерНаТовары</name>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузке</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОтбору</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВЯчейках</registerRecords>
  <attributes>
    <name>ВсегоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаОтгрузки</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаПоЗаданиюНаПеревозку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ОтправительПолучательТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимПросмотраПоТоварам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскаяОперация</name>
    <type>
      <types>EnumRef.СкладскиеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыРасходныхОрдеров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыПоРаспоряжениям</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DefinedType.РаспоряжениеНаОтгрузку</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтгружаемыеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоУпаковочныйЛист</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УпаковочныйЛистРодитель</name>
      <type>
        <types>DocumentRef.УпаковочныйЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковочныйЛист</name>
      <type>
        <types>DocumentRef.УпаковочныйЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.ДействияСоСтрокамиОрдеровНаОтгрузку</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Торговля_11__демо/src/Documents/ЗапросСкладскогоЖурналаВЕТИС/ЗапросСкладскогоЖурналаВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросСкладскогоЖурналаВЕТИС</name>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <attributes>
    <name>ХозяйствующийСубъект</name>
    <type>
      <types>CatalogRef.ХозяйствующиеСубъектыВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Предприятие</name>
    <type>
      <types>CatalogRef.ПредприятияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговыйОбъект</name>
    <type>
      <types>DefinedType.ТорговыйОбъектВЕТИС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.ПродукцияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатурыВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВЕТИС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияВЕТИС</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмеренияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаписьСкладскогоЖурнала</name>
      <type>
        <types>CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Торговля_11__демо/src/CommonModules/ИнтеграцияИСКлиентСерверПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

#Область СерииНоменклатуры

// Для некоторых видов документов может быль более одного набора параметров указания серий. 
// Нужно явно указать одну из них.
//
// Параметры:
//  ПараметрыУказанияСерий - Структура - изменяемое(возвращаемое) значение
//  Контекст - ФормаКлиентскогоПриложения
Процедура ПриОпределенииПараметровУказанияСерий(ПараметрыУказанияСерий, Контекст) Экспорт
	
	//++ НЕ ГОСИС
	Если Контекст.ИмяФормы = "Документ.РасходныйОрдерНаТовары.Форма.ФормаДокумента" Тогда
		ПараметрыУказанияСерий = Контекст.ПараметрыУказанияСерий.ОтгружаемыеТовары;
	ИначеЕсли Контекст.ИмяФормы = "Документ.ОтборРазмещениеТоваров.Форма.ФормаДокумента" Тогда
		ПараметрыУказанияСерий = Контекст.ПараметрыУказанияСерий.Отбор;
	КонецЕсли;
	//-- НЕ ГОСИС
	Возврат;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СерииНоменклатуры

// Процедура устанавливает использование статусов серий необязательного вида "Можно указать"
// для объектов метаданных подсистемы ГосИС
//
// Параметры:
//  Использовать - Булево - разрешить использование статусов
//  ПараметрыУказанияСерий - Произвольный - Параметры указания серий.
Процедура ИспользоватьСтатусСерийМожноУказать(Использовать, ПараметрыУказанияСерий) Экспорт
	
	//++ НЕ ГОСИС
	// (См. НоменклатураКлиентСервер.ПараметрыУказанияСерий)
	Если ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ВходящаяТранспортнаяОперацияВЕТИС"
		Или ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ЗапросСкладскогоЖурналаВЕТИС"
		Или ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ИнвентаризацияПродукцииВЕТИС"
		Или ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ИсходящаяТранспортнаяОперацияВЕТИС"
		Или ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ПроизводственнаяОперацияВЕТИС"
		Или (СтрНачинаетсяС(ПараметрыУказанияСерий.ПолноеИмяОбъекта, "Обработка.ПроверкаИПодборПродукцииИСМП")
			Или СтрНачинаетсяС(ПараметрыУказанияСерий.ПолноеИмяОбъекта, "Обработка.ВиртуальнаяАгрегацияУпаковокИСМП")
			Или СтрНачинаетсяС(ПараметрыУказанияСерий.ПолноеИмяОбъекта, "Обработка.ПроверкаИПодборТабачнойПродукцииМОТП"))
			И ПараметрыУказанияСерий.ИмяПоляСклад = Неопределено
		Тогда
		Использовать = Истина;
	КонецЕсли;
	//-- НЕ ГОСИС
	Возврат;

КонецПроцедуры

// Функция проверяет необходимость указания серии в строке по статусу.
//
// Параметры:
//  ТребуетсяУказать    - Булево - в этом статусе требуется указание серий.
//  СтатусУказанияСерий - Число  - статус указания серии в строке табличной части
//
Процедура ПроверитьНеобходимоУказатьСерию(ТребуетсяУказать, СтатусУказанияСерий) Экспорт
	
	//++ НЕ ГОСИС
	ТребуетсяУказать = НоменклатураКлиентСервер.СтатусыСерийСерияНеУказана().Найти(СтатусУказанияСерий)<>Неопределено;
	//-- НЕ ГОСИС
	Возврат;
	
КонецПроцедуры

// В процедуре требуется определить признак использования серий по параметрам указания серий
//
// Параметры:
//  Использование - Булево - Признак использования серий
//  ПараметрыУказанияСерий - Произвольный - Параметры указания серий объекта конфигурации.
//
Процедура ИспользованиеСерийПоПараметрамУказанияСерий(Использование, ПараметрыУказанияСерий) Экспорт
	
	//++ НЕ ГОСИС
	Если ПараметрыУказанияСерий=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыУказанияСерий.Свойство("ИспользоватьСерииНоменклатуры") Тогда
		Использование = ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры;
	ИначеЕсли ПараметрыУказанияСерий.Свойство("ВыходныеИзделия") Тогда
		Использование = ПараметрыУказанияСерий.ВыходныеИзделия.ИспользоватьСерииНоменклатуры;
	КонецЕсли;
	//-- НЕ ГОСИС
	Возврат;
	
КонецПроцедуры

#КонецОбласти

// Заполняет представление строки номенклатуры.
//
// Параметры:
//  Представление  - Строка                                     - представление для заполнения,
//  Номенклатура   - ОпределяемыйТип.Номенклатура               - ссылка на номенклатуру,
//  Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры - ссылка на характеристику номенклатуры,
//  Упаковка       - ОпределяемыйТип.Упаковка                   - ссылка на упаковку.
//  Серия          - ОпределяемыйТип.СерияНоменклатуры          - ссылка на серию номенклатуры.
Процедура ЗаполнитьПредставлениеНоменклатуры(Представление, Номенклатура, Характеристика, Упаковка, Серия) Экспорт
	
	//++ НЕ ГОСИС
	Представление = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
		СокрЛП(Номенклатура),
		СокрЛП(Характеристика),
		Упаковка,
		Серия);
	//-- НЕ ГОСИС
	Возврат;
	
КонецПроцедуры

Процедура ЗаполнитьСоответствиеПолейДокументовОснований(Форма, ТипОбъекта, СоответствиеПолей) Экспорт
	
	//++ НЕ ГОСИС
	
	Если ТипОбъекта = Тип("ДокументСсылка.ПогашениеСДИЗЗЕРНО") Тогда
		
		МассивИменДокументов = Новый Массив;
		МассивИменДокументов.Добавить("ПриобретениеТоваровУслуг");
		МассивИменДокументов.Добавить("ВозвратТоваровОтКлиента");
		МассивИменДокументов.Добавить("ПеремещениеТоваров");
		МассивИменДокументов.Добавить("ПередачаТоваровМеждуОрганизациями");
		МассивИменДокументов.Добавить("ВозвратТоваровМеждуОрганизациями");
		МассивИменДокументов.Добавить("ВыкупПринятыхНаХранениеТоваров");
		МассивИменДокументов.Добавить("ПриемкаТоваровНаХранение");
		
	
		
		Для Каждого ИмяДокумента Из МассивИменДокументов Цикл
			СоответствиеПолей.Вставить(ИмяДокумента, Новый Соответствие);
			СоответствиеПолей[ИмяДокумента].Вставить("Организация", "Организация");
		КонецЦикла;
		
	КонецЕсли;
	
	//-- НЕ ГОСИС
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти
